# HostObjFailures Properties

---
The BuiltInFailuresHostObjFailures type exposes the following members.
| Name| Description
---|---|---
| HostMismatch|  Can't use this type in this host.
| ReferencesNulled|  One or more references are or have become invalid.
Top
#### Reference
BuiltInFailuresHostObjFailures Class
Autodesk.Revit.DB Namespace